package tgbot;
/**
 * Логика обработки сообщений
 */
class BotLogic {
    /**
     * Обрабатывает сообщение пользователя и формирует ответ
     *
     * @param text текст, отправленный пользователем
     * @return ответ бота;
     */
    String botMessage(String text) {
        return switch (text) {
            case "/start" -> "Это Telegram-бот, который повторяет твои сообщения.\n" +
                    "Список команд: help.";
            case "/help" -> """
                    Как пользоваться ботом:
                    1. Отправь любой текст — я повторю его.
                    2. Используй /start, чтобы увидеть приветствие.
                    3. Используй /help, чтобы снова открыть эту инструкцию.""";
            default -> "Вы ввели «" + text + "»";
        };
    }
}

